#include "stdio.h"
/*
打印菱形
时间限制: 1 Sec  内存限制: 12 MB
提交: 3  解决: 0
[提交] [状态] [讨论版] [命题人:外部导入]
题目描述

从键盘输入一个整数n(1≤n≤9)，打印出指定的菱形。

输入

正整数n（1≤n≤9）。

输出

指定的菱形。 第一行前面有n-1个空格，第二行有n-2个空格，依此类推。

样例输入

5

样例输出

    *
   ***
  *****
 *******
*********
 *******
  *****
   ***
    *
*/
int main() {
  int n,a,j;
  scanf("%d", &n);
  for (a = 0; a < n; a++) {
    for (j = 0; j < n-1-a; j++) {
      printf(" ");
    }
    for (j = 0; j < 2*a+1; j++) {
      printf("*");
    }
    printf("\n");
  }
  for ( a = 0; a < n-1 ; a++) {
    for (j = 0; j < a+1; j++) {
      printf(" ");
    }
    for (j = 0; j < 2*n-3-2*a; j++) {
      printf("*");
    }
    printf("\n");
  }
  return 0;
}
