/*
杨辉三角（二维数组）
时间限制: 1 Sec  内存限制: 128 MB
提交: 1  解决: 1
[提交] [状态] [讨论版] [命题人:外部导入]
题目描述

1
1  1
1  2   1
1  3   3   1
1  4   6   4  1
1  5 10 10  5  1
上面的图形熟悉吗？它就是我们中学时候学过的杨辉三角。

输入

输入数据包含多组测试数据。
每组测试数据的输入只有一个正整数n（1≤n≤30），表示将要输出的杨辉三角的层数。
输入以0结束。

输出

对应于每一个输入，请输出相应层数的杨辉三角，每一层的整数之间用一个空格隔开，每一个杨辉三角后面加一个空行。

样例输入

2
3
0

样例输出

1
1 1

1
1 1
1 2 1
*/
#include "stdio.h"
int main() {
  int count, i, j;
  while(1){
    scanf("%d", &count) != 0;
    if (count == 0) {
      break;
    }
    int a[count][count];
    for ( i = 0; i < count; i++) {
      for (j = 0; j <= i; j++) {
        if (j == 0) {
          a[i][j] = 1;
        }
        else if (i == j) {
          a[i][j] = 1;
        }
        else{
          a[i][j] = a[i-1][j-1] + a[i-1][j];
        }
      }
    }
    for ( i = 0; i < count; i++) {
      for (j = 0; j <= i; j++) {
        printf("%d ", a[i][j]);
      }
      printf("\n");
    }
    printf("\n");
  }
  return 0;
}
