/*---------------------------------------------
任意输入两个字符串（使用数组存储，串长度不超过19个字符，允许出现空格字符，并且一个串内字符不重复），
求两串中相同的字符（按相同字符在第一个串的先后顺序输出）。
输入：poiuytr
      asofigjkutmn
输出：oiut
v1.0
----------------------------------------------*/
#include"stdio.h"//从这里看出puts,gets在stdio中
main()
{
	char a[19],b[19],same[19];
	int i,j,x=0;
	gets(a);
	gets(b);
	for(i=0;a[i]!='\0';i++){
		for(j=0;b[j]!='\0';j++){
			if(a[i] == b[j]){
				same[x] = a[i];
				x++;
			}//将相同的元素保存到same中
		}
	}
	same[x] = '\0';//最终字符串加上结束符,否则会有随机地字符
	puts(same);

}
